<?php 
    return [
        //共通メッセージ
        'COMMON_E001' => '再入力パスワードが一致していません。',
        'COMMON_E002' => 'パスワードは以下のルールに従って入力してください。
                XXX文字以上
                XXX
                XXX
                ',
        'COMMON_E003' => 'メッセージ内容は255文字以内で入力してください。',
        'COMMON_E004' => 'ログインIDを入力してください。',
        'COMMON_E005' => 'パスワードを入力してください。',
        'COMMON_E006' => 'ログインIDは255文字以内で入力してください。',
        'COMMON_E007' => 'ログインIDは半角英数で入力してください。',
        'COMMON_E008' => '氏名を入力してください。',
        'COMMON_E009' => '氏名は255文字以内で入力してください。',
        'COMMON_E010' => '社員番号は255文字以内で入力してください。',
        'COMMON_E011' => 'メールアドレスの値が不正です。',
        'COMMON_E012' => '備考は255文字以内で入力してください。',
        'COMMON_E013' => '顔画像をファイルから選択するか、カメラで撮影してください。',
        'COMMON_E014' => 'メールアドレスは255文字以内で入力してください。',
        'COMMON_M001' => '上記内容で登録が完了しました。',
        'COMMON_M002' => '更新が正常に完了しました。',
        'COMMON_M003' => '更新が失敗にに完了しました。',

        //SA_LGA001	4.2 ログイン後画面共通部（システム管理者）
        //SU_LGA002	4.3 ログイン後画面共通部（システム利用者）
        'SA_LGA001_E003' => 'ログインID、またはパスワードが間違っています。',

        //SU_LG001	5.1 システム管理者用ログイン画面

        //SU_LG002	5.2 システム利用者用ログイン画面

        //SU_PW001	5.3 初回パスワード変更画面
        
        //SU_PW002	5.4 パスワード変更画面
        'SU_PW002_E001' => '現在のパスワードを入力してください。',
        'SU_PW002_E002' => '現在のパスワードが正しくありません。',
        'SU_PW002_E003' => '新パスワードを入力してください。',
        'SU_PW002_E004' => '新パスワードは以下のルールに従って入力してください。
                XXX文字以上
                XXX
                XXX
                ',

        //SU_PW003	5.5 パスワード更新完了画面
        'SU_PW003_M001' => 'パスワードの更新が完了しました。',

        //SA_CP001	5.6 企業一覧画面


        //SA_CP002	5.7 企業登録画面
        //SA_CP003	5.8 企業編集画面
        'SA_CP002_E001' => '企業名を入力してください。',
        'SA_CP002_E002' => '企業名は255文字以内で入力してください。',
        'SA_CP002_E003' => '企業コードを入力してください。',
        'SA_CP002_E004' => '企業コードは255文字以内で入力してください。',
        'SA_CP002_E005' => '企業コードは半角英数で入力してください。',
        'SA_CP002_E006' => '企業種別を選択してください。',
        'SA_CP002_E007' => '企業種別の値が不正です。',
        'SA_CP002_E008' => '運用保守企業の値が不正です。',
        'SA_CP002_E009' => 'オーナーログインIDを入力してください。',
        'SA_CP002_E010' => 'オーナーログインIDは255文字以内で入力してください。',
        'SA_CP002_E011' => 'オーナーログインIDは半角英数で入力してください。',
        'SA_CP002_E012' => 'オーナー初期パスワードを入力してください。',
        'SA_CP002_E013' => 'オーナー氏名を入力してください。',
        'SA_CP002_E014' => 'オーナー氏名は255文字以内で入力してください。',
        'SA_CP002_E015' => 'オーナーメールアドレスを入力してください。',
        'SA_CP002_E016' => 'オーナーメールアドレスは255文字以内で入力してください。',
        'SA_CP002_E017' => 'オーナーメールアドレスの形式が正しくありません。',

        //SA_CP004	5.9 企業更新完了画面

        //SA_CP005	5.10 企業詳細画面

        //SA_EV001	5.11 拠点一覧画面

        //SA_EV002	5.12 拠点登録画面
        //SA_EV003	5.13 拠点編集画面
        'SA_EV003_E001' => '拠点名を入力してください。',
        'SA_EV003_E002' => '拠点名は255文字以内で入力してください。',
        
        //SA_EV004	5.14 拠点更新完了画面

        //SA_EV005	5.15 拠点詳細画面

        //SU_EC001	5.16 外部連携一覧画面

        //SU_EC002	5.17 外部連携設定画面

        //SA_IQ001	5.18 問合せ一覧画面

        //SU_IQ002	5.19 問合せフォーム画面

        //SU_IQ003	5.20 問合せ完了画面
        'SU_IQ003_M001' => '問合せ登録が正常に完了しました。
                            回答は、メールにて送信いたします。
                            また、問合せ一覧画面からも、ステータスを確認できます。
                            回答までしばらくお待ちください。',
        //SU_IQ004	5.21 問合せ詳細画面

        //SA_AW001	5.22 回答フォーム画面

        //SA_AW002	5.23 回答完了画面
        'SA_AW002_M001' => '回答登録が正常に完了しました。',

        //SU_DB001	5.24 管理者ダッシュボード画面

        //SU_DB002	5.25 個人ダッシュボード画面

        //SU_US001	5.26 ユーザ一覧画面

        //SU_US002	5.27 ユーザ登録画面
        'SU_US002_E001' => '権限を選択してください。',
        'SU_US002_E002' => '権限の値が不正です。',
        'SU_US002_E003' => '初期パスワードを入力してください。',
        'SU_US002_E004' => '初期パスワードは以下のルールに従って入力してください。
                        XXX文字以上
                        XXX
                        XXX',
        'SU_US002_E005' => 'ログインIDが存在しているので、他のログインIDを入力してください。',

        //SU_US003	5.28 ユーザ編集画面
        'SU_US003_Q001' => 'このユーザを削除してよろしいですか？',

        //SU_US004	5.29 ユーザ更新完了画面

        //SU_US005	5.30 ユーザ詳細画面

        //SU_VS001	5.31 訪問者一覧画面

        //SU_VS002	5.32 訪問者登録画面
        'SU_VS002_E001' => '訪問者氏名を入力してください。',
        'SU_VS002_E002' => '訪問者氏名は255文字以内で入力してください。',
        'SU_VS002_E003' => '訪問者メールアドレスは255文字以内で入力してください。',
        'SU_VS002_E004' => '訪問者メールアドレスの値が不正です。',
        'SU_VS002_E005' => '利用開始日を入力してください。',
        'SU_VS002_E006' => '利用開始日の日付が不正です。',
        'SU_VS002_E007' => '利用終了日の日付が不正です。',
        'SU_VS002_E008' => '訪問先部署は255文字以内で入力してください。',
        'SU_VS002_E009' => '訪問先担当者氏名を入力してください。',
        'SU_VS002_E010' => '訪問先担当者氏名は255文字以内で入力してください。',
        'SU_VS002_E011' => '訪問先担当者メールアドレスは255文字以内で入力してください。',
        'SU_VS002_E012' => '訪問先担当者メールアドレスの値が不正です。',

        //SU_VS003	5.33 訪問者編集画面

        //SU_VS004	5.34 訪問者承認画面

        //SU_VS005	5.35 訪問者更新完了画面
        'SU_VS005_M001' => '訪問者情報の更新が完了しました。',

        //SU_VS006	5.36 訪問者詳細画面

        //SU_PR001	5.37 通過記録一覧画面

        //SU_PR002	5.38 通過記録編集画面
        'SU_PR002_E001' => '通過日時を入力してください。',
        'SU_PR002_E002' => '通過日時の値が不正です。',
        'SU_PR002_E003' => 'モードを選択してください。',
        'SU_PR002_E004' => 'モードの値が不正です。',
        'SU_PR002_E005' => '検温値は小数点第1位までの正の小数で入力してください。',
        'SU_PR002_E006' => 'マスク判定を選択してください。',
        'SU_PR002_E007' => 'マスク判定の値が不正です。',

        //SU_PR003	5.39 通過記録更新完了画面
        'SU_PR003_M001' => '通過記録情報の更新が完了しました。',

        //SU_PR004	5.40 通過記録詳細画面

        //SU_IV001	5.41 問診回答一覧画面

        //SU_IV002	5.42 問診回答登録画面

        //SU_IV003	5.43 問診回答詳細画面

        //SU_EV006	5.44 拠点設定画面

        //SU_DV001	5.45 デバイス登録画面
        //SU_DV002	5.46 デバイス設定画面
        'SU_DV001_E001' => 'デバイス名を入力してください。',
        'SU_DV001_E002' => 'デバイス名は255文字以内で入力してください。',
        'SU_DV001_E003' => 'AIZE連携キーを入力してください。',
        'SU_DV001_E004' => 'AIZE連携キーは255文字以内で入力してください。',
        'SU_DV001_E005' => '顔認証有無を選択してください。',
        'SU_DV001_E006' => '顔認証有無の値が不正です。',
        'SU_DV001_E007' => '問診票判定有無を選択してください。',
        'SU_DV001_E008' => '問診票判定有無の値が不正です。',
        'SU_DV001_E009' => '検温有無を選択してください。',
        'SU_DV001_E010' => '検温有無の値が不正です。',
        'SU_DV001_E011' => '検温閾値を入力してください。
                        （検温有無が有りの場合のみ）
                        ',
        'SU_DV001_E012' => '検温閾値は小数点第1位までの正の小数で入力してください。',
        'SU_DV001_E013' => '検温閾値は50.0以下の値を入力してください。',
        'SU_DV001_E014' => 'マスク判定有無を選択してください。',
        'SU_DV001_E015' => 'マスク判定有無の値が不正です。',
        'SU_DV001_E016' => 'Welcomeメッセージ有無を選択してください。',
        'SU_DV001_E017' => 'Welcomeメッセージ有無の値が不正です。',

        //SU_US006	5.47 ユーザ情報一括登録
        'SU_US006_E001' => 'メールアドレスを入力してください。',

        //SU_IV004	5.48 問診票設定

        //SU_WMT001	5.49 Welcomeテンプレート一覧画面

        //SU_WMT002	5.50 Welcomeテンプレート登録画面

        //SU_WMT003	5.51 Welcomeテンプレート編集画面

        //SU_WMT004	5.52 Welcomeテンプレート更新完了画面
        'SU_WMT004_M001' => 'Welcomeテンプレートの更新が完了しました。',

        //SU_WMT005	5.53 Welcomeテンプレート詳細画面

        //SU_VR001	5.54 訪問申請画面

        //SU_VR002	5.55 訪問申請完了画面
        'SU_VR002_M001' => '訪問申請が完了しました。
                        お急ぎのご用件がありましたら、お手数ではございますが担当者にご連絡くだ
                        さいますようお願い申し上げます。',
    ];